## 1.使用多重索引进行重塑

用于重排列俩个基础操作：

    stack(堆叠)
        该操作会旋转或将列中的数据透视到行
    unstack(拆堆)
        该操作将行中的数据透视到列

In [1]:
import pandas as pd
import numpy as np

In [3]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)), index = pd.Index(['Ohio','Colorado'], name = 'state'),
                    columns = pd.Index(['one','two','three'],name = 'number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [8]:
result = data.stack() 
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [9]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

**可以传入一个层级序号或名称来拆分指定的序列**

In [10]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

**在DataFrame中拆堆时，被拆堆的层级会变为结果中最低的层级**

In [11]:
df = pd.DataFrame({'left':result,'right':result+5},columns = pd.Index(['left','right'],name = 'side'))
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [12]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

## 2.将‘宽’透视为‘长’

**使用pandas.melt方法，将多列合并成一列**

In [13]:
df = pd.DataFrame({'key':['foo','bar','baz'],'A':[1, 2, 3],'B':[4, 5, 6],'C':[7, 8, 9]})
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [15]:
melted = pd.melt(df,['key'])
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

**使用pivot方法，将‘长’透视成‘宽’，相当于melt的反操作**

In [21]:
reshaped = melted.pivot('key','variable','value')
reshaped

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

**如果漏掉最后一个参数，得到的含有多层列的DataFrame**

In [22]:
melted.pivot('key','variable')

         value
variable     A  B  C
key
bar          2  5  8
baz          3  6  9
foo          1  4  7